{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<nl>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<py>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<indent>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<dedent>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<newline>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "<str>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "<num>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "Unigram",
    "unk_id": 4,
    "vocab": [
      [
        "<pad>",
        0.0
      ],
      [
        "<s>",
        0.0
      ],
      [
        "</s>",
        0.0
      ],
      [
        "<mask>",
        0.0
      ],
      [
        "<unk>",
        0.0
      ],
      [
        "<nl>",
        0.0
      ],
      [
        "<py>",
        0.0
      ],
      [
        "<indent>",
        0.0
      ],
      [
        "<dedent>",
        0.0
      ],
      [
        "<newline>",
        0.0
      ],
      [
        "<str>",
        0.0
      ],
      [
        "<num>",
        0.0
      ],
      [
        "<",
        -1.856607932483307
      ],
      [
        ">",
        -1.8584730698048375
      ],
      [
        "newline",
        -2.599136625074454
      ],
      [
        "g",
        -3.0430619000425487
      ],
      [
        "(",
        -3.094723802080015
      ],
      [
        ")",
        -3.0948965202219796
      ],
      [
        "num",
        -3.2008916706537747
      ],
      [
        "=",
        -3.3371551526169263
      ],
      [
        ",",
        -3.6140427076787276
      ],
      [
        "[",
        -3.9217579476556104
      ],
      [
        "]",
        -3.9218211072490696
      ],
      [
        ":",
        -3.960294275503305
      ],
      [
        "d",
        -4.007778913954134
      ],
      [
        "indent",
        -4.065531004418997
      ],
      [
        "edent",
        -4.06554053980998
      ],
      [
        "v",
        -4.076358243998239
      ],
      [
        "1",
        -4.2524415675737295
      ],
      [
        ".",
        -4.50054374415784
      ],
      [
        "3",
        -4.574303988952037
      ],
      [
        "+",
        -4.689284728629891
      ],
      [
        "4",
        -4.724842755887892
      ],
      [
        "2",
        -4.753344686957936
      ],
      [
        "-",
        -4.802507313011324
      ],
      [
        "in",
        -4.8960593084577475
      ],
      [
        "5",
        -4.909475755531867
      ],
      [
        "for",
        -4.985843339779711
      ],
      [
        "if",
        -5.044682039514594
      ],
      [
        "6",
        -5.076510272815073
      ],
      [
        "int",
        -5.15505330009451
      ],
      [
        "str",
        -5.1966569077498
      ],
      [
        "input",
        -5.205777082650037
      ],
      [
        "print",
        -5.291462929791182
      ],
      [
        "range",
        -5.311009269990034
      ],
      [
        "7",
        -5.371323985323432
      ],
      [
        "v2",
        -5.423876300977778
      ],
      [
        "*",
        -5.579975551653513
      ],
      [
        "8",
        -5.593363263239096
      ],
      [
        "split",
        -5.705849557900878
      ],
      [
        "map",
        -5.8706224218283385
      ],
      [
        "9",
        -5.89942952682542
      ],
      [
        "else",
        -6.076142825028301
      ],
      [
        "def",
        -6.114965172167384
      ],
      [
        "return",
        -6.134398347283225
      ],
      [
        "import",
        -6.245572384687563
      ],
      [
        "n",
        -6.2571446847742145
      ],
      [
        "list",
        -6.287730728619545
      ],
      [
        "append",
        -6.40354508853483
      ],
      [
        "%",
        -6.414572403453942
      ],
      [
        "i",
        -6.438107695258262
      ],
      [
        "ans",
        -6.452665049596549
      ],
      [
        "s",
        -6.457635896503907
      ],
      [
        "g10",
        -6.47599996861811
      ],
      [
        "a",
        -6.539676910663337
      ],
      [
        "len",
        -6.541290495509779
      ],
      [
        "sys",
        -6.688421851937768
      ],
      [
        "self",
        -6.697565068916111
      ],
      [
        "x",
        -6.69970593304039
      ],
      [
        "g11",
        -6.775950453862711
      ],
      [
        "//",
        -6.822253726071821
      ],
      [
        "p",
        -6.882137566963019
      ],
      [
        "**",
        -6.889374532306446
      ],
      [
        "and",
        -6.903306471920867
      ],
      [
        "elif",
        -6.984176968904325
      ],
      [
        "g12",
        -7.060586414891391
      ],
      [
        "func1",
        -7.071100768815844
      ],
      [
        "l",
        -7.117896852086011
      ],
      [
        "from",
        -7.157886027889528
      ],
      [
        "while",
        -7.176722470525025
      ],
      [
        "max",
        -7.177439426633596
      ],
      [
        "N",
        -7.177648106398523
      ],
      [
        "!=",
        -7.200750636605154
      ],
      [
        "break",
        -7.206325057142735
      ],
      [
        "t",
        -7.234697048471089
      ],
      [
        "b",
        -7.2745189151451655
      ],
      [
        "c",
        -7.300061352604581
      ],
      [
        "A",
        -7.319798142537335
      ],
      [
        "min",
        -7.328590470117421
      ],
      [
        "True",
        -7.345697925748945
      ],
      [
        "r",
        -7.348465514197457
      ],
      [
        "g13",
        -7.360560367991251
      ],
      [
        "/",
        -7.381923372016155
      ],
      [
        "math",
        -7.389228044416463
      ],
      [
        "stdin",
        -7.39069718942754
      ],
      [
        "sum",
        -7.485014873028826
      ],
      [
        "readline",
        -7.498011339107187
      ],
      [
        "e",
        -7.545630687196306
      ],
      [
        "m",
        -7.626391735521649
      ],
      [
        "abs",
        -7.6364387763812935
      ],
      [
        "count",
        -7.640020104562087
      ],
      [
        "g14",
        -7.657433020278809
      ],
      [
        "v10",
        -7.663576216785367
      ],
      [
        "S",
        -7.665811485507268
      ],
      [
        "f",
        -7.811905795935003
      ],
      [
        "False",
        -7.839110771912988
      ],
      [
        "y",
        -7.849088787121531
      ],
      [
        "or",
        -7.853509010226787
      ],
      [
        "func2",
        -7.920372594189038
      ],
      [
        "exit",
        -7.9228986731993665
      ],
      [
        "__",
        -7.93088343789935
      ],
      [
        "collections",
        -7.956203682083249
      ],
      [
        "g15",
        -7.9564257047178
      ],
      [
        "sort",
        -8.005615932739037
      ],
      [
        "lambda",
        -8.014772351009007
      ],
      [
        "not",
        -8.033936830077613
      ],
      [
        "continue",
        -8.044149668692038
      ],
      [
        "k",
        -8.083031232698513
      ],
      [
        "__name",
        -8.135759701483313
      ],
      [
        "j",
        -8.169792907412218
      ],
      [
        "cnt",
        -8.171896237239384
      ],
      [
        "main",
        -8.17575149189212
      ],
      [
        "{",
        -8.229171389486117
      ],
      [
        "}",
        -8.237518942803211
      ],
      [
        "set",
        -8.239611974174819
      ],
      [
        "v12",
        -8.24145111952116
      ],
      [
        "q",
        -8.265999077808582
      ],
      [
        "sorted",
        -8.287111375173211
      ],
      [
        "tmp",
        -8.289184735116413
      ],
      [
        "strip",
        -8.30084456813445
      ],
      [
        "B",
        -8.31780175354834
      ],
      [
        "float",
        -8.399751380453406
      ],
      [
        "func3",
        -8.442269482495647
      ],
      [
        "deque",
        -8.443889604936146
      ],
      [
        "dict",
        -8.452294985776884
      ],
      [
        "itertools",
        -8.454613412043173
      ],
      [
        "res",
        -8.481057056953807
      ],
      [
        "v13",
        -8.5132726211361
      ],
      [
        "gcd",
        -8.534486005750571
      ],
      [
        "flag",
        -8.558304079634368
      ],
      [
        "g17",
        -8.565185735477442
      ],
      [
        "bisect",
        -8.577768910887444
      ],
      [
        "heapq",
        -8.591936481534121
      ],
      [
        "None",
        -8.621647939736775
      ],
      [
        "h",
        -8.633397010127586
      ],
      [
        "join",
        -8.633434793369526
      ],
      [
        "w",
        -8.635523740749669
      ],
      [
        "Counter",
        -8.645213873028375
      ],
      [
        ";",
        -8.680923362282504
      ],
      [
        "default",
        -8.685833609576258
      ],
      [
        "&",
        -8.69377065935189
      ],
      [
        "copy",
        -8.697805223752972
      ],
      [
        "mod",
        -8.699398071943277
      ],
      [
        "u",
        -8.699494199057872
      ],
      [
        "L",
        -8.712740371763449
      ],
      [
        "reverse",
        -8.72395818920959
      ],
      [
        "pop",
        -8.7393248758081
      ],
      [
        "setrecursionlimi",
        -8.749499435606056
      ],
      [
        "as",
        -8.76717363666505
      ],
      [
        "func4",
        -8.768255043987466
      ],
      [
        "enumerate",
        -8.784350500802836
      ],
      [
        "C",
        -8.797512372220536
      ],
      [
        "X",
        -8.81878532945838
      ],
      [
        "add",
        -8.823077939004678
      ],
      [
        "key",
        -8.917299122686865
      ],
      [
        "T",
        -8.923687158127791
      ],
      [
        "index",
        -8.946974676076175
      ],
      [
        "find",
        -8.966383406062079
      ],
      [
        "pow",
        -9.025313798701411
      ],
      [
        "func5",
        -9.046852997131467
      ],
      [
        "_",
        -9.064239191890579
      ],
      [
        "v15",
        -9.084010141224406
      ],
      [
        "buffer",
        -9.105455067197301
      ],
      [
        "raw_input",
        -9.116713811487973
      ],
      [
        "numpy",
        -9.129127544669403
      ],
      [
        "heappush",
        -9.138422665189822
      ],
      [
        "result",
        -9.146866328887644
      ],
      [
        "o",
        -9.15144121894011
      ],
      [
        "left",
        -9.156297449170363
      ],
      [
        "array",
        -9.166099399489834
      ],
      [
        "g19",
        -9.169663132208932
      ],
      [
        "sqrt",
        -9.170912496299037
      ],
      [
        "K",
        -9.197642756491678
      ],
      [
        "D",
        -9.197791920543423
      ],
      [
        "solve",
        -9.21872530545464
      ],
      [
        "M",
        -9.23334424059587
      ],
      [
        "INF",
        -9.23511211041
      ],
      [
        "ret",
        -9.245270264400354
      ],
      [
        "temp",
        -9.263896675396959
      ],
      [
        "read",
        -9.284658903631966
      ],
      [
        "class",
        -9.296752823411772
      ],
      [
        "func6",
        -9.29873921420006
      ],
      [
        "H",
        -9.313535768962588
      ],
      [
        "heappop",
        -9.3195759788669
      ],
      [
        "fractions",
        -9.341262750077368
      ],
      [
        "factorial",
        -9.34222703252123
      ],
      [
        "P",
        -9.348265354958347
      ],
      [
        "0",
        -9.360061713203773
      ],
      [
        "ceil",
        -9.370241046629552
      ],
      [
        "data",
        -9.374014304710233
      ],
      [
        "next",
        -9.37905391958927
      ],
      [
        "root",
        -9.383897748067522
      ],
      [
        "right",
        -9.397112730210354
      ],
      [
        "dfs",
        -9.403037130723465
      ],
      [
        "bisect_left",
        -9.406444479169632
      ],
      [
        "arr",
        -9.408963613591531
      ],
      [
        "MOD",
        -9.411861528328876
      ],
      [
        "format",
        -9.442917872132432
      ],
      [
        "g20",
        -9.468540264838342
      ],
      [
        "size",
        -9.476672689342163
      ],
      [
        "zip",
        -9.480846231546073
      ],
      [
        "func7",
        -9.500833691799139
      ],
      [
        "reduce",
        -9.515938547708451
      ],
      [
        "z",
        -9.51643596054209
      ],
      [
        "now",
        -9.517061112016721
      ],
      [
        "floor",
        -9.53279392609943
      ],
      [
        "parents",
        -9.554085490577686
      ],
      [
        "R",
        -9.559852465562573
      ],
      [
        "time",
        -9.568118544934453
      ],
      [
        "functools",
        -9.571013365152007
      ],
      [
        "tuple",
        -9.61970658332447
      ],
      [
        "pass",
        -9.65554426022655
      ],
      [
        "LI",
        -9.65559723831403
      ],
      [
        "combinations",
        -9.656813648907804
      ],
      [
        "Q",
        -9.662121909226562
      ],
      [
        "func8",
        -9.668005926487478
      ],
      [
        "popleft",
        -9.675980258338566
      ],
      [
        "ord",
        -9.681746306075548
      ],
      [
        "items",
        -9.697032235421489
      ],
      [
        "Cls1",
        -9.714198595320866
      ],
      [
        "queue",
        -9.715634364657483
      ],
      [
        "mid",
        -9.726700190516189
      ],
      [
        "check",
        -9.765266801276839
      ],
      [
        "I",
        -9.780590632216029
      ],
      [
        "permutations",
        -9.783324829987956
      ],
      [
        "string",
        -9.793072598581805
      ],
      [
        "answer",
        -9.79453737590842
      ],
      [
        "^",
        -9.822143053077363
      ],
      [
        "node",
        -9.824702550936188
      ],
      [
        "dist",
        -9.825415140061232
      ],
      [
        "parent",
        -9.828192605566699
      ],
      [
        "line",
        -9.844107120304335
      ],
      [
        "values",
        -9.85673456072977
      ],
      [
        "remove",
        -9.867381509460552
      ],
      [
        "func9",
        -9.86793797492934
      ],
      [
        "bisect_right",
        -9.876254547044791
      ],
      [
        "lst",
        -9.877387429127355
      ],
      [
        "W",
        -9.88771356417138
      ],
      [
        "que",
        -9.888108925202333
      ],
      [
        "product",
        -9.906458639494078
      ],
      [
        "accumulate",
        -9.906957100011082
      ],
      [
        "table",
        -9.91995731553188
      ],
      [
        "stack",
        -9.9259004328046
      ],
      [
        "operator",
        -9.935724507902638
      ],
      [
        "flg",
        -9.947533102787053
      ],
      [
        "total",
        -9.947789139450926
      ],
      [
        "tree",
        -9.948337907734375
      ],
      [
        "cost",
        -9.95368052458116
      ],
      [
        "G",
        -9.966896753633906
      ],
      [
        "replace",
        -9.976194508218386
      ],
      [
        "keys",
        -9.989565918197796
      ],
      [
        "de",
        -10.044651497597059
      ],
      [
        "Y",
        -10.04540840622459
      ],
      [
        "func10",
        -10.05210097090482
      ],
      [
        "os",
        -10.062722514361173
      ],
      [
        "idx",
        -10.068469785119976
      ],
      [
        "par",
        -10.07102704339824
      ],
      [
        "dic",
        -10.077130838407133
      ],
      [
        "random",
        -10.08544801965724
      ],
      [
        "rank",
        -10.088608629588556
      ],
      [
        "deep",
        -10.097247777173292
      ],
      [
        "ab",
        -10.104649328608698
      ],
      [
        "val",
        -10.110914636399645
      ],
      [
        "start",
        -10.120596532193895
      ],
      [
        "st",
        -10.133847605265496
      ],
      [
        "pos",
        -10.154749781249611
      ],
      [
        "reversed",
        -10.15818644839701
      ],
      [
        "chr",
        -10.165980344166346
      ],
      [
        "all",
        -10.176553450122908
      ],
      [
        "List",
        -10.185393947673054
      ],
      [
        "counter",
        -10.199084406995306
      ],
      [
        "global",
        -10.199408763948982
      ],
      [
        "cur",
        -10.206420860070004
      ],
      [
        "bit",
        -10.226919366092474
      ],
      [
        "\"",
        -10.242232712271253
      ],
      [
        "ok",
        -10.254585765397275
      ],
      [
        "sep",
        -10.255202408633377
      ],
      [
        "ls",
        -10.25656262706529
      ],
      [
        "lis",
        -10.258449417146775
      ],
      [
        "open",
        -10.259221640100211
      ],
      [
        "value",
        -10.263553500493481
      ],
      [
        "heapify",
        -10.265853205855805
      ],
      [
        "write",
        -10.272357305111216
      ],
      [
        "try",
        -10.280409431061475
      ],
      [
        "V",
        -10.281162120455596
      ],
      [
        "itemgetter",
        -10.294777503871348
      ],
      [
        "score",
        -10.295320907438235
      ],
      [
        "except",
        -10.298723267265435
      ],
      [
        "mul",
        -10.300168669618882
      ],
      [
        "lcm",
        -10.300423336173024
      ],
      [
        "zeros",
        -10.307944146898066
      ],
      [
        "diff",
        -10.312151637099543
      ],
      [
        "visited",
        -10.323877390781977
      ],
      [
        "prev",
        -10.329716646875038
      ],
      [
        "divisors",
        -10.339200454010609
      ],
      [
        "stdout",
        -10.35207073040133
      ],
      [
        "v20",
        -10.383118688471809
      ],
      [
        "insert",
        -10.407426306398307
      ],
      [
        "Decimal",
        -10.408581136845083
      ],
      [
        "E",
        -10.419700510708779
      ],
      [
        "|",
        -10.42089515326421
      ],
      [
        "dtype",
        -10.42256901648454
      ],
      [
        "comb",
        -10.440400452285942
      ],
      [
        "IO",
        -10.462281373560659
      ],
      [
        "graph",
        -10.467468049262374
      ],
      [
        "xrange",
        -10.481538972078308
      ],
      [
        "most_common",
        -10.486909360420775
      ],
      [
        "F",
        -10.48703463952455
      ],
      [
        "cos",
        -10.509091465820005
      ],
      [
        "out",
        -10.519273382470168
      ],
      [
        "memo",
        -10.52291469228352
      ],
      [
        "ma",
        -10.523560053030163
      ],
      [
        "func",
        -10.530074331111264
      ],
      [
        "AB",
        -10.557254552284292
      ],
      [
        "file",
        -10.564722354521884
      ],
      [
        "decimal",
        -10.574682150638605
      ],
      [
        "edge",
        -10.599376049955765
      ],
      [
        "resolve",
        -10.606899691832474
      ],
      [
        "calc",
        -10.608657518947739
      ],
      [
        "fact",
        -10.626203901498867
      ],
      [
        "token",
        -10.631791160421669
      ],
      [
        "type",
        -10.648861965515222
      ],
      [
        "last",
        -10.653306239497917
      ],
      [
        "bin",
        -10.658664731124041
      ],
      [
        "pre",
        -10.663555349231697
      ],
      [
        "extend",
        -10.667086142571666
      ],
      [
        "_list",
        -10.667287626249554
      ],
      [
        "yield",
        -10.669895808652026
      ],
      [
        "@",
        -10.689366186782568
      ],
      [
        "edges",
        -10.690124785628068
      ],
      [
        "query",
        -10.694746313793166
      ],
      [
        "func11",
        -10.69932083219031
      ],
      [
        "update",
        -10.702281704167907
      ],
      [
        "assert",
        -10.719032039346713
      ],
      [
        "_cache",
        -10.73423382982228
      ],
      [
        "func12",
        -10.746570031435642
      ],
      [
        "lru",
        -10.751996015422634
      ],
      [
        "length",
        -10.77799410581764
      ],
      [
        "color",
        -10.784828178463702
      ],
      [
        "log",
        -10.79599143040469
      ],
      [
        "Error",
        -10.812964466192902
      ],
      [
        "search",
        -10.823675638952299
      ],
      [
        "op",
        -10.833222421657581
      ],
      [
        "combinations_",
        -10.850752238602636
      ],
      [
        "radians",
        -10.860496584230457
      ],
      [
        "new",
        -10.864105035097298
      ],
      [
        "point",
        -10.872107333380555
      ],
      [
        "other",
        -10.873374245696752
      ],
      [
        "sub",
        -10.875408799670446
      ],
      [
        "fac",
        -10.905171413068224
      ],
      [
        "xy",
        -10.906011910977464
      ],
      [
        "number",
        -10.90692796134957
      ],
      [
        "judge",
        -10.917750674115922
      ],
      [
        "prime",
        -10.941018022726414
      ],
      [
        "path",
        -10.945367060705745
      ],
      [
        "used",
        -10.969926980662699
      ],
      [
        "output",
        -10.970065007768975
      ],
      [
        "long",
        -10.981694993192406
      ],
      [
        "a_list",
        -10.989718029183175
      ],
      [
        "bool",
        -10.989749746618559
      ],
      [
        "roots",
        -10.99571044573077
      ],
      [
        "decode",
        -10.995825880417447
      ],
      [
        "_f",
        -11.02233921569659
      ],
      [
        "first",
        -11.023457050476106
      ],
      [
        "test",
        -11.025773393697998
      ],
      [
        "put",
        -11.031302408496192
      ],
      [
        "round",
        -11.040349078568092
      ],
      [
        "_length",
        -11.05155449030935
      ],
      [
        "cmb",
        -11.051606481310174
      ],
      [
        "U",
        -11.05764766071889
      ],
      [
        "int64",
        -11.07045554064403
      ],
      [
        "?",
        -11.084288247362611
      ],
      [
        "func13",
        -11.08901246029271
      ],
      [
        "union",
        -11.125258642670763
      ],
      [
        "row",
        -11.125325265580198
      ],
      [
        "bfs",
        -11.126341745385412
      ],
      [
        "depth",
        -11.128288666717712
      ],
      [
        "target",
        -11.131768162188495
      ],
      [
        "top",
        -11.144536744090262
      ],
      [
        "grid",
        -11.145772505454408
      ],
      [
        "primes",
        -11.148613572665338
      ],
      [
        "lower",
        -11.14995968791904
      ],
      [
        "ascii_lowercase",
        -11.151671853276905
      ],
      [
        "odd",
        -11.15738195255777
      ],
      [
        "UnionFind",
        -11.158358193130633
      ],
      [
        "lazy",
        -11.161566768114744
      ],
      [
        "with_replacement",
        -11.163839588412335
      ],
      [
        "distance",
        -11.166917516856332
      ],
      [
        "cc",
        -11.168831647379411
      ],
      [
        "ac",
        -11.180949588166815
      ],
      [
        "MAP",
        -11.18265242083796
      ],
      [
        "inp",
        -11.201753281178226
      ],
      [
        "|=",
        -11.210781565111812
      ],
      [
        "quit",
        -11.22157207256583
      ],
      [
        "base",
        -11.221717302068408
      ],
      [
        "dice",
        -11.224029345392868
      ],
      [
        "raise",
        -11.22457985610732
      ],
      [
        "divmod",
        -11.225719279964961
      ],
      [
        "repeat",
        -11.228835907886152
      ],
      [
        "rec",
        -11.233593981879824
      ],
      [
        "abc",
        -11.245676651288901
      ],
      [
        "nodes",
        -11.254754876608642
      ],
      [
        "MAX",
        -11.261597289387604
      ],
      [
        "func14",
        -11.262507336326463
      ],
      [
        "plus",
        -11.265457838454024
      ],
      [
        "flush",
        -11.268266583975295
      ],
      [
        "groupb",
        -11.280034242776061
      ],
      [
        "seek",
        -11.290081498387332
      ],
      [
        "rand",
        -11.295974887383867
      ],
      [
        "atan",
        -11.29738958519261
      ],
      [
        "ModInt",
        -11.298102895165824
      ],
      [
        "dis",
        -11.298625591410879
      ],
      [
        "even",
        -11.301199955476072
      ],
      [
        "Ans",
        -11.303460397457945
      ],
      [
        "lines",
        -11.313340237099085
      ],
      [
        "Z",
        -11.324228839442574
      ],
      [
        "As",
        -11.32546573178273
      ],
      [
        "scipy",
        -11.334021535978643
      ],
      [
        "seen",
        -11.334833483385264
      ],
      [
        "minus",
        -11.337016808591082
      ],
      [
        "current",
        -11.340446137663147
      ],
      [
        "py",
        -11.352149889768281
      ],
      [
        "II",
        -11.355126467244709
      ],
      [
        "iterate_",
        -11.35724233798756
      ],
      [
        "ANS",
        -11.362852578647873
      ],
      [
        "instance",
        -11.376774387099525
      ],
      [
        "ans_list",
        -11.38087987658394
      ],
      [
        "item",
        -11.382419309878804
      ],
      [
        "ch",
        -11.388287401074852
      ],
      [
        "weight",
        -11.394159942432951
      ],
      [
        "Queue",
        -11.398976413506738
      ],
      [
        "buf",
        -11.40124641712854
      ],
      [
        "MI",
        -11.402882206032643
      ],
      [
        "iter",
        -11.403628841962181
      ],
      [
        "LS",
        -11.40509573635335
      ],
      [
        "one",
        -11.410403061992278
      ],
      [
        "vector",
        -11.414672346779597
      ],
      [
        "unite",
        -11.418376919696057
      ],
      [
        "segfunc",
        -11.41983881310923
      ],
      [
        "power",
        -11.423478739422537
      ],
      [
        "func15",
        -11.432237486264102
      ],
      [
        "zfill",
        -11.438770610458581
      ],
      [
        "col",
        -11.439912398579327
      ],
      [
        "upper",
        -11.44148344751397
      ],
      [
        "const",
        -11.442043717939397
      ],
      [
        "is_prime",
        -11.448257778211953
      ],
      [
        "loop",
        -11.450516109201713
      ],
      [
        "Node",
        -11.463932354184863
      ],
      [
        "~",
        -11.4766934359052
      ],
      [
        "Cls2",
        -11.479188794557325
      ],
      [
        "wri",
        -11.481629292243023
      ],
      [
        "height",
        -11.482990386821887
      ],
      [
        "mode",
        -11.486553668378717
      ],
      [
        "name",
        -11.494094832602253
      ],
      [
        "max_",
        -11.495720881237805
      ],
      [
        "matrix",
        -11.496890594031917
      ],
      [
        "cumsum",
        -11.502490144560802
      ],
      [
        "order",
        -11.505642473533568
      ],
      [
        "cand",
        -11.509976986963112
      ],
      [
        "stderr",
        -11.511037536295262
      ],
      [
        "move",
        -11.512349736896912
      ],
      [
        "bb",
        -11.512751177026038
      ],
      [
        "digits",
        -11.51605070445852
      ],
      [
        "object",
        -11.523450424262046
      ],
      [
        "using",
        -11.525055334251512
      ],
      [
        "log2",
        -11.53122937457102
      ],
      [
        "cout",
        -11.532177184109539
      ],
      [
        "DP",
        -11.533768595774593
      ],
      [
        "eval",
        -11.535396531037097
      ],
      [
        "word",
        -11.535536558271371
      ],
      [
        "_size",
        -11.541605000781718
      ],
      [
        "numbers",
        -11.546280475981957
      ],
      [
        "filter",
        -11.555334593809729
      ],
      [
        "pair",
        -11.562611582854954
      ],
      [
        "method",
        -11.56598932499727
      ],
      [
        "zero",
        -11.570120238700268
      ],
      [
        "members",
        -11.572365846301638
      ],
      [
        "hypot",
        -11.580842502695184
      ],
      [
        "ascii_uppercase",
        -11.581261951667363
      ],
      [
        "static",
        -11.585241457798615
      ],
      [
        "INT",
        -11.588190871229273
      ],
      [
        "num_list",
        -11.589887968584494
      ],
      [
        "argv",
        -11.593821965854069
      ],
      [
        "money",
        -11.595945475926175
      ],
      [
        "points",
        -11.599565509987011
      ],
      [
        "state",
        -11.600882448094332
      ],
      [
        "hoge",
        -11.606641071868705
      ],
      [
        "low",
        -11.611399257540365
      ],
      [
        "std",
        -11.612769150962967
      ],
      [
        "step",
        -11.615446012940902
      ],
      [
        "any",
        -11.615830374896834
      ],
      [
        "head",
        -11.616334045302876
      ],
      [
        "String",
        -11.622469631279968
      ],
      [
        "func16",
        -11.6248265333653
      ],
      [
        "degrees",
        -11.628053754124501
      ],
      [
        "rest",
        -11.63063812876548
      ],
      [
        "gyaku_kaijo",
        -11.637103680364952
      ],
      [
        "before",
        -11.660673619796198
      ],
      [
        "group",
        -11.661169519575745
      ],
      [
        "match",
        -11.663433860107451
      ],
      [
        "merge",
        -11.679868839824602
      ],
      [
        "adj",
        -11.68521627392454
      ],
      [
        "same",
        -11.689004058332582
      ],
      [
        "dijkstra",
        -11.695002642097549
      ],
      [
        "high",
        -11.698702536066534
      ],
      [
        "heappushpop",
        -11.700768608002672
      ],
      [
        "empty",
        -11.70150348824066
      ],
      [
        "inpl",
        -11.702509282143703
      ],
      [
        "rev",
        -11.714452692488452
      ],
      [
        "amari",
        -11.719993495933249
      ],
      [
        "co",
        -11.724619549596335
      ],
      [
        "axis",
        -11.725248027535073
      ],
      [
        "func17",
        -11.728524991401741
      ],
      [
        "price",
        -11.733686931940515
      ],
      [
        "Max",
        -11.741571349296644
      ],
      [
        "rem",
        -11.743749960996228
      ],
      [
        "chk",
        -11.746070050507607
      ],
      [
        "is_integer",
        -11.747300100890403
      ],
      [
        "get_",
        -11.750504101982187
      ],
      [
        "inverse",
        -11.752621483069657
      ],
      [
        "push",
        -11.754784668481223
      ],
      [
        "seq",
        -11.756808736094413
      ],
      [
        "s_list",
        -11.757094406998972
      ],
      [
        "field",
        -11.757124866335342
      ],
      [
        "make_divisors",
        -11.76898977664867
      ],
      [
        "prod",
        -11.770463063107849
      ],
      [
        "dat",
        -11.773480776734598
      ],
      [
        "_memo",
        -11.773648223431055
      ],
      [
        "area",
        -11.773991030185938
      ],
      [
        "mat",
        -11.77569963484086
      ],
      [
        "alphabet",
        -11.781670676102774
      ],
      [
        "tr",
        -11.78631002427637
      ],
      [
        "heap",
        -11.790943474406662
      ],
      [
        "Value",
        -11.798197558419789
      ],
      [
        "unit",
        -11.804332579592343
      ],
      [
        "ptr",
        -11.810265268725209
      ],
      [
        "bc",
        -11.814072550928033
      ],
      [
        "second",
        -11.815426338921247
      ],
      [
        "_max",
        -11.815602974967913
      ],
      [
        "maze",
        -11.816777144033185
      ],
      [
        "ar",
        -11.817862642188642
      ],
      [
        "nxt",
        -11.817883480049233
      ],
      [
        "Point",
        -11.820808631182881
      ],
      [
        "_set",
        -11.82946603295336
      ],
      [
        "LIST",
        -11.831761378522103
      ],
      [
        "jit",
        -11.832695108161236
      ],
      [
        "sum_",
        -11.837061604739201
      ],
      [
        "hq",
        -11.839286731169581
      ],
      [
        "acc",
        -11.839920985520738
      ],
      [
        "add_edge",
        -11.847963672492785
      ],
      [
        "Base",
        -11.848348930387418
      ],
      [
        "min_",
        -11.849576021667827
      ],
      [
        "ide_ele",
        -11.860968497612058
      ],
      [
        "factorization",
        -11.865193127867183
      ],
      [
        "change",
        -11.866930688432634
      ],
      [
        "func18",
        -11.867544413812134
      ],
      [
        "A_list",
        -11.867753889271746
      ],
      [
        "is_",
        -11.868447445552908
      ],
      [
        "func20",
        -11.868784779280775
      ],
      [
        "'",
        -11.86983993804225
      ],
      [
        "minimum",
        -11.874664291595392
      ],
      [
        "sparse",
        -11.876145968759552
      ],
      [
        "O",
        -11.878889649837122
      ],
      [
        "10",
        -11.880485796756034
      ],
      [
        "char",
        -11.888364508431453
      ],
      [
        "eps",
        -11.891104454144022
      ],
      [
        "dot",
        -11.89436507443181
      ],
      [
        "child",
        -11.898131240404979
      ],
      [
        "debug",
        -11.898432472747944
      ],
      [
        "Fraction",
        -11.898698776468878
      ],
      [
        "done",
        -11.906834219867875
      ],
      [
        "ABC",
        -11.911029611383846
      ],
      [
        "ap",
        -11.928237666595576
      ],
      [
        "where",
        -11.928385614542176
      ],
      [
        "can",
        -11.928954365089817
      ],
      [
        "__x",
        -11.93502877708281
      ],
      [
        "template",
        -11.93579421866972
      ],
      [
        "N0",
        -11.944112033078817
      ],
      [
        "com",
        -11.945546584175709
      ],
      [
        "Exception",
        -11.948602640870028
      ],
      [
        "XY",
        -11.950637769036517
      ],
      [
        "_index",
        -11.952262662896423
      ],
      [
        "bs",
        -11.954887777091933
      ],
      [
        "children",
        -11.95493521485216
      ],
      [
        "LR",
        -11.960850846350699
      ],
      [
        "day",
        -11.967354868677239
      ],
      [
        "pr",
        -11.96836128921534
      ],
      [
        "tmp2",
        -11.970767917610278
      ],
      [
        "turn",
        -11.972895900385664
      ],
      [
        "Sum",
        -11.980782453033797
      ],
      [
        "delete",
        -11.98241795902982
      ],
      [
        "offset",
        -11.984335253266641
      ],
      [
        "route",
        -11.985106107562112
      ],
      [
        "init",
        -11.989154196659735
      ],
      [
        "tot",
        -11.994409632156708
      ],
      [
        "modinv",
        -11.995561953334784
      ],
      [
        "new_",
        -11.996983974156363
      ],
      [
        "statistics",
        -11.999376049955831
      ],
      [
        "alpha",
        -12.004312114673015
      ],
      [
        "best",
        -12.005289927104782
      ],
      [
        "Num",
        -12.010959653368227
      ],
      [
        "cards",
        -12.014382526838641
      ],
      [
        "found",
        -12.021170830597859
      ],
      [
        "counts",
        -12.022428609211506
      ],
      [
        "bottom",
        -12.024285206052477
      ],
      [
        "chain",
        -12.029397198160762
      ],
      [
        "void",
        -12.03466518192299
      ],
      [
        "func19",
        -12.035514397398273
      ],
      [
        "limit",
        -12.038215140567637
      ],
      [
        "sign",
        -12.038334947112869
      ],
      [
        "board",
        -12.040248955750767
      ],
      [
        "max_num",
        -12.055570656753133
      ],
      [
        "datetime",
        -12.057528721201898
      ],
      [
        "fct",
        -12.066487165312003
      ],
      [
        "rep",
        -12.073623332188983
      ],
      [
        "ones",
        -12.083348007374035
      ],
      [
        "EOF",
        -12.084529812169732
      ],
      [
        "keta",
        -12.089585718499519
      ],
      [
        "maximum",
        -12.091154914085784
      ],
      [
        "numba",
        -12.101468283844428
      ],
      [
        "finv",
        -12.102050675232832
      ],
      [
        "xx",
        -12.104570860520452
      ],
      [
        "No",
        -12.10556755079939
      ],
      [
        "cal",
        -12.112480949020838
      ],
      [
        "words",
        -12.114534988466142
      ],
      [
        "AC",
        -12.11460714056012
      ],
      [
        "pattern",
        -12.118364282961561
      ],
      [
        "black",
        -12.12084803803723
      ],
      [
        "card",
        -12.122623361672309
      ],
      [
        "level",
        -12.124091475827942
      ],
      [
        "goal",
        -12.126493882786164
      ],
      [
        "find_root",
        -12.126896879589536
      ],
      [
        "Bytes",
        -12.128875217936637
      ],
      [
        "blue",
        -12.132372454598086
      ],
      [
        "digit",
        -12.132477571785369
      ],
      [
        "back",
        -12.133269822884639
      ],
      [
        "Index",
        -12.134159966520805
      ],
      [
        "front",
        -12.136261898534405
      ],
      [
        "two",
        -12.138197772394781
      ],
      [
        "_sum",
        -12.139445851047892
      ],
      [
        "times",
        -12.140499106787342
      ],
      [
        "con",
        -12.144766194216261
      ],
      [
        "info",
        -12.147174290717116
      ],
      [
        "tail",
        -12.14797329232235
      ],
      [
        "work",
        -12.14869175947285
      ],
      [
        "aaa",
        -12.150398954706898
      ],
      [
        "_count",
        -12.150500241691526
      ],
      [
        "BC",
        -12.151298235339535
      ],
      [
        "namespace",
        -12.151800496457724
      ],
      [
        "text",
        -12.152422751554875
      ],
      [
        "median",
        -12.169444392820617
      ],
      [
        "csgraph",
        -12.172402393862667
      ],
      [
        "read_int",
        -12.176760553762152
      ],
      [
        "LI_",
        -12.178206677194293
      ],
      [
        "cache",
        -12.181769144163136
      ],
      [
        "show_",
        -12.184095383876782
      ],
      [
        "Flag",
        -12.1879139886563
      ],
      [
        "divisor",
        -12.19171249962191
      ],
      [
        "_base",
        -12.193510638962184
      ],
      [
        "sort_left",
        -12.193573745475193
      ],
      [
        "box",
        -12.196782512957432
      ],
      [
        "BIT",
        -12.198486547501616
      ],
      [
        "nex",
        -12.199329641563207
      ],
      [
        "Root",
        -12.20121130467571
      ],
      [
        "full",
        -12.201854153386506
      ],
      [
        "nt",
        -12.210342610339293
      ],
      [
        "hash",
        -12.214593438159035
      ],
      [
        "args",
        -12.21603974897184
      ],
      [
        "nCr",
        -12.21796038554217
      ],
      [
        "visit",
        -12.222875212164935
      ],
      [
        "colors",
        -12.225559004441186
      ],
      [
        "s_",
        -12.229492263956937
      ],
      [
        "Count",
        -12.232725409700244
      ],
      [
        "Dice",
        -12.232928740090598
      ],
      [
        "clear",
        -12.23622565785188
      ],
      [
        "）",
        -12.237702158812713
      ],
      [
        "rnk",
        -12.237790864508924
      ],
      [
        "pq",
        -12.239148876561085
      ],
      [
        "list_",
        -12.239223132742318
      ],
      [
        "（",
        -12.239370029666793
      ],
      [
        "st_size",
        -12.24152673760491
      ],
      [
        "x_list",
        -12.242926564726783
      ],
      [
        "fstat",
        -12.243083809780233
      ],
      [
        "_func",
        -12.24450396543837
      ],
      [
        "islower",
        -12.246081703575951
      ],
      [
        "a_",
        -12.247182883131954
      ],
      [
        "p_list",
        -12.251499430836851
      ],
      [
        "facinv",
        -12.253589664898682
      ],
      [
        "down",
        -12.254563069243396
      ],
      [
        "costs",
        -12.25520825311649
      ],
      [
        "MIN",
        -12.257036779556255
      ],
      [
        "combination",
        -12.261208895683781
      ],
      [
        "Yes",
        -12.26414564214235
      ],
      [
        "_lists",
        -12.266004172291474
      ],
      [
        "candidate",
        -12.271232632317375
      ],
      [
        "Fast",
        -12.272240674118487
      ],
      [
        "next_",
        -12.274537554668122
      ],
      [
        "white",
        -12.274614678015789
      ],
      [
        "b_list",
        -12.276050961561578
      ],
      [
        "remain",
        -12.27882666015715
      ],
      [
        "kouho",
        -12.282485367788883
      ],
      [
        "typedef",
        -12.287815997414496
      ],
      [
        "UF",
        -12.29205487831794
      ],
      [
        "balance",
        -12.297880179648136
      ],
      [
        "Tree",
        -12.29874298813953
      ],
      [
        "old",
        -12.299025719889402
      ],
      [
        "A_",
        -12.30101722356024
      ],
      [
        "Dict",
        -12.304923140766128
      ],
      [
        "ys",
        -12.31068352081136
      ],
      [
        "_lst",
        -12.312082457915851
      ],
      [
        "sz",
        -12.3198112404839
      ],
      [
        "denominator",
        -12.320844905781442
      ],
      [
        "water",
        -12.321092159453926
      ],
      [
        "ary",
        -12.321997951663361
      ],
      [
        "factors",
        -12.325768611849092
      ],
      [
        "results",
        -12.326019293246583
      ],
      [
        "over",
        -12.326318864613471
      ],
      [
        "todo",
        -12.327220907501694
      ],
      [
        "xor",
        -12.329523999252725
      ],
      [
        "tell",
        -12.329787440703297
      ],
      [
        "_idx",
        -12.33280364953283
      ],
      [
        "_len",
        -12.342159231329598
      ],
      [
        "shape",
        -12.347691739235112
      ],
      [
        "input_raw",
        -12.352171663893854
      ],
      [
        "curr",
        -12.353714773835977
      ],
      [
        "kaijo_",
        -12.357668394115771
      ],
      [
        "numerator",
        -12.362273958334626
      ],
      [
        "direction",
        -12.363610134197879
      ],
      [
        "scores",
        -12.368851242020902
      ],
      [
        "apper",
        -12.369126359608563
      ],
      [
        "half",
        -12.369592299084532
      ],
      [
        "po",
        -12.370686437407024
      ],
      [
        "factinv",
        -12.378700869766504
      ],
      [
        "read_int_",
        -12.38355668275605
      ],
      [
        "th",
        -12.385239048903658
      ],
      [
        "center",
        -12.388581062001307
      ],
      [
        "_key",
        -12.390193889562344
      ],
      [
        "int32",
        -12.391031565716258
      ],
      [
        "hp",
        -12.396249376584176
      ],
      [
        "kwarg",
        -12.396657359352064
      ],
      [
        "deq",
        -12.397211709917311
      ],
      [
        "pivot",
        -12.39765219910443
      ],
      [
        "OWr",
        -12.399812389557534
      ],
      [
        "factor",
        -12.400393133978694
      ],
      [
        "(\"",
        -12.401139469704354
      ],
      [
        "_dict",
        -12.405559204156573
      ],
      [
        "arg",
        -12.40674195311967
      ],
      [
        "ry",
        -12.408035390907543
      ],
      [
        "prime_factorize",
        -12.412252039310516
      ],
      [
        "largest",
        -12.414009970889834
      ],
      [
        "_cnt",
        -12.418247961841248
      ],
      [
        "moji",
        -12.419001612745843
      ],
      [
        "vec",
        -12.419028384498143
      ],
      [
        "alp",
        -12.419397011089751
      ],
      [
        "sol",
        -12.42288596019274
      ],
      [
        "nu",
        -12.42332598207053
      ],
      [
        "road",
        -12.433177839325335
      ],
      [
        "hs",
        -12.43320798300975
      ],
      [
        "J",
        -12.433413363955232
      ],
      [
        "primeNum",
        -12.435479701412756
      ],
      [
        "mod2",
        -12.436157827345461
      ],
      [
        "!",
        -12.441603112762026
      ],
      [
        "reshape",
        -12.443265982983473
      ],
      [
        "side",
        -12.444820405885883
      ],
      [
        "double",
        -12.454532272644755
      ],
      [
        "city",
        -12.45683527498365
      ],
      [
        "cum",
        -12.461006442737284
      ],
      [
        "cycle",
        -12.46413770290903
      ],
      [
        "command",
        -12.466642843532174
      ],
      [
        "sums",
        -12.469187958093933
      ],
      [
        "acos",
        -12.469517635007495
      ],
      [
        "theta",
        -12.47340408771414
      ],
      [
        "use",
        -12.474571313213152
      ],
      [
        "var",
        -12.476984789772118
      ],
      [
        "indices",
        -12.477969956248893
      ],
      [
        "ET",
